# Даны 2 числа a и b. Получить их сумму, разность и произведение. Результат вывести на экран


a = 5
b = 2
print(f'a + b = {a + b}')
print(f'a - b = {a - b}')
print(f'a * b = {a * b}')