# Даны числа x и y. Получить x − y / 1 + xy. Результат вывести на экран
# здесь нет смысла что-либо делить на 1, поэтому я применю скобки и сделаю такой вариант  (х - y) / (1 + xy)


x = 2
y = 1
print((x - y) / (1 + x * y))





